app/controllers/api/categories_controller.rb

SELECT "categories".* FROM "categories"
---
        def index
            render json: Category.all, root: false