app/controllers/api/edges_controller.rb

SELECT "edges".* FROM "edges"
---
        def index
            render json: Edge.all, root: false

INSERT INTO "requirements" ("created_at", "mode", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-19 14:46:46.586242"], ["mode", "rank"], ["updated_at", "2014-08-19 14:46:46.586242"], ["value", "Tier - 1"]]
INSERT INTO "edges" ("category_id", "created_at", "description", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["created_at", "2014-08-19 14:46:46.592772"], ["description", "This is a awesome shooter"], ["updated_at", "2014-08-19 14:46:46.592772"]]
---
        def create
            rank = Requirement.create(mode: 'rank', value: params["rank"]["name"])

            edge = Edge.new
            edge.name = params["name"]
            edge.description = params["description"]
            edge.category_id = params["category"]["id"]
            edge.requirements = [ rank ]
            edge.save

SELECT  "edges".* FROM "edges"  WHERE "edges"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "edges" WHERE "edges"."id" = 6
---
        def destroy
            edge = Edge.find(params[:id])
            edge.delete